{
  "type": "Collection",
  "id": "harshness",
  "stac_version": "1.1.0",
  "description": "The Harshness Index generates harshness maps based on wave height, sea ice concentration, and iceberg density data. The user can set the magnitude of each variable that is considered 'harsh' and the weight that is given the variable.\r\n\r\nA harshness/attractiveness index is a single parameter which combines various data to provide an overall measure of the environmental harshness or attractiveness of a region. In general, the index is given by the following formula:\r\n\r\n![](https://github.com/gtif-cerulean/assets/blob/main/markdowns/Harshness_EQ1.png?raw=true)\r\n\r\nWhere:\r\n\r\n-   Vi is the ith variable\r\n-   Wi is the weight assigned to the nth variable. ![](https://github.com/gtif-cerulean/assets/blob/main/markdowns/Harshness_EQ2.png?raw=true)\r\n-   Ni is the normalization factor for the ith variable – typically the largest expected value of Vi.\r\n\r\nThe default harshness index used in the CIF is the Fleming-Drover Harshness Index which takes into account:\r\n\r\n-   Mean annual number of days with a sea ice concentration greater than six-tenths (C)\r\n-   Mean annual number of days with a significant wave height greater than four meters (W)\r\n-   Mean annual open-water iceberg areal density (D)\r\n\r\nValues for these parameters are normalized before incorporating them into the Harshness Index calculation. In the cases of pack ice and waves, the numbers of days exceeding the criteria were divided by 350 and 110, respectively. These values represent the approximate maximum values expected. For iceberg density, the values were normalized (on scale of 0 to 10) by calculating the logarithm of the iceberg density as follows:\r\n\r\n-   For iceberg density of -6 (log of 10-6 km-2) or lower, a value of 0\r\n-   For iceberg density of -1 (log of 10-1 km-2), a value of 10\r\n-   Otherwise, a linear scaling between 0 and 10\r\n\r\nThe Fleming-Drover Harshness Index is given by the formula when:\r\n\r\n-   V1 is the average number of days per year with a sea ice concentration \\> 60%\r\n-   V2 is the average number of days per year with a significant wave height \\> 4 metres\r\n-   V3 is the average annual iceberg density (number of icebergs per 100 km2)\r\n-   W1 is 6\r\n-   W2 is 2.5\r\n-   W3 is 1.5\r\n-   N1 is 350\r\n-   N2 is 110\r\n-   N3 is (12 + 2\\*log10(V3))\r\n-   The iceberg density is within the given range\r\n\r\nThe harshness/attractiveness index can be customized to use other variables and equations.\r\n\r\n",
  "links": [
    {
      "rel": "root",
      "href": "../../catalog.json",
      "type": "application/json",
      "title": "Cerulean GTIF project catalog"
    },
    {
      "rel": "parent",
      "href": "../collection.json",
      "type": "application/json",
      "title": "Harshness Index"
    }
  ],
  "themes": [
    "Shipping",
    "Aquaculture",
    "Energy"
  ],
  "agency": [
    "C-CORE"
  ],
  "collection_group": "A. Algorithms",
  "endpointtype": "Collection-only",
  "title": "Harshness Index",
  "extent": {
    "spatial": {
      "bbox": [
        [
          -179,
          55,
          179,
          89
        ]
      ]
    },
    "temporal": {
      "interval": [
        [
          "2026-02-15T09:01:41.697426Z",
          null
        ]
      ]
    }
  },
  "license": "other"
}